espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/serialization/common/transport/ser_phy/ser_phy_nrf51_uart_stm_conn.c
static void uart_peripheral_enable_wo_flow(void)
{
    if (!(NRF_UART0->ENABLE & (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos)))
    {
        NRF_UART0->PSELCTS       = UART_PIN_DISCONNECTED;
        NRF_UART0->PSELRTS       = UART_PIN_DISCONNECTED;
        NRF_UART0->CONFIG       &= ~(UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
        NRF_UART0->TASKS_STARTRX = 1;
        NRF_UART0->TASKS_STARTTX = 1;
        NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
    }
}


static void uart_peripheral_enable(void)
{
    if (!(NRF_UART0->ENABLE & (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos)))
    {
        NRF_UART0->PSELCTS       = SER_PHY_UART_CTS;
        NRF_UART0->PSELRTS       = SER_PHY_UART_RTS;
        NRF_UART0->CONFIG       |= (UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
        NRF_UART0->TASKS_STARTRX = 1;
        NRF_UART0->TASKS_STARTTX = 1;
        NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
    }
}


static void uart_peripheral_disable(void)
{
    if ((m_tx_state == UART_IDLE || m_tx_state == UART_STALL) &&
        (m_rx_state == UART_IDLE))
    {
        uint32_t pins;
        NRF_UART0->TASKS_STOPTX = 1;
        NRF_UART0->TASKS_STOPRX = 1;
        NRF_UART0->PSELCTS      = UART_PIN_DISCONNECTED;
        NRF_UART0->PSELRTS      = UART_PIN_DISCONNECTED;
        NRF_UART0->ENABLE       = (UART_ENABLE_ENABLE_Disabled << UART_ENABLE_ENABLE_Pos);

        nrf_gpio_cfg_input(SER_PHY_UART_RTS, NRF_GPIO_PIN_NOPULL);

        (void) app_gpiote_user_enable(m_gpiote_uid);
        (void) app_gpiote_pins_state_get(m_gpiote_uid, &pins);

        if (!pins)
        {
            NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
            nrf_gpio_cfg_output(SER_PHY_UART_RTS);
            uart_peripheral_enable();
        }
    }
}


static void uart_tx_start(void)
{
    if (mp_tx_stream != NULL)
    {
        //If RX is already ongoing then no wakeup signal is required.
        if (m_rx_state == UART_IDLE)
        {
            (void) app_gpiote_user_disable(m_gpiote_uid);
            uart_peripheral_enable_wo_flow();
            NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
            nrf_gpio_cfg_output(SER_PHY_UART_RTS);
            NRF_GPIO->OUTCLR = 1 << SER_PHY_UART_RTS;
            nrf_delay_us(4);
            NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
            uart_peripheral_connect_flow();
        }
    }
}


static void uart_tx_send(void)
{
    //First send 2 bytes of header then payload
    if (m_tx_stream_index < SER_PHY_HEADER_SIZE)
    {
        NRF_UART0->TXD = m_tx_length_buf[m_tx_stream_index++];
    }
    else if (m_tx_stream_index < m_tx_stream_length)
    {
        NRF_UART0->TXD = mp_tx_stream[m_tx_stream_index++ - SER_PHY_HEADER_SIZE];
    }
}


static void uart_tx_last_byte(void)
{
    uint32_t pins;

    uart_peripheral_disconnect_flow();
    m_tx_state = UART_TX_LAST_BYTE_WAIT;

    (void) app_gpiote_user_enable(m_gpiote_uid);
    (void) app_gpiote_pins_state_get(m_gpiote_uid, &pins);

    if (!pins) //All pins are low --> last byte can be transmitted.
    {
        (void) app_gpiote_user_disable(m_gpiote_uid);

        //Re-check state as it might have changed due to preemption of current interrupt.
        if (m_tx_state == UART_TX_LAST_BYTE_WAIT)
        {
            m_tx_state = UART_TX_COMPLETE;
            uart_tx_send();
        }
    }
}


static void tx_complete_event_send(void)
{
    mp_tx_stream       = NULL;
    m_tx_stream_length = 0;
    m_tx_stream_index  = 0;

    m_ser_phy_event_tx.evt_type = SER_PHY_EVT_TX_PKT_SENT;
    m_ser_phy_event_handler(m_ser_phy_event_tx);
}


static void uart_txdrdy_handle(void)
{
    NRF_UART0->EVENTS_TXDRDY = 0;

    if (m_tx_state == UART_TX_SEND || m_tx_state == UART_IDLE)
    {
        if (m_tx_stream_index < (m_tx_stream_length - 1))
        {
            m_tx_state = UART_TX_SEND;
            uart_tx_send();
            //Keep same state.
        }
        else if (m_tx_stream_index == m_tx_stream_length)
        {
            m_tx_state = UART_IDLE;
            tx_complete_event_send();
        }
        else
        {
            uart_tx_last_byte();
        }
    }
    else if (m_tx_state == UART_TX_COMPLETE)
    {
        m_tx_state = UART_IDLE;

        if (m_rx_state == UART_IDLE)
        {
            uint32_t pins;
            (void) app_gpiote_pins_state_get(m_gpiote_uid, &pins);

            if (pins)
            {
                uart_peripheral_disable();
            }
            else
            {
                uart_peripheral_connect_flow();
                m_cts_high_disconnect = true;
                (void) app_gpiote_user_enable(m_gpiote_uid);
                (void) app_gpiote_pins_state_get(m_gpiote_uid, &pins);

                if (pins)
                {
                    //If second sample show CTS high it either
                    //1) happened BEFORE gpiote enable and uart should be disabled.
                    //(m_cts_high_disconnect == true).
                    //2) happened AFTER gpiote enable and an interrupt low->high has occured then
                    //uart should NOT be disabled as the ISR has disabled the UART.
                    //(m_cts_high_disconnect == false).
                    if (m_cts_high_disconnect == true)
                    {
                        m_cts_high_disconnect = false;
                        uart_peripheral_disable();
                    }
                }
            }
        }
        else
        {
            uart_peripheral_connect_flow();
        }

        tx_complete_event_send();
    }
    else if (m_tx_state == UART_STALL)
    {
        if (m_tx_stream_index == m_tx_stream_length)
        {
            tx_complete_event_send();
        }
        else
        {
            m_tx_pending = true;
        }
    }
    else
    {
        //Do nothing.
    }
}


static __INLINE void on_cts_high(void)
{
    if (m_cts_high_disconnect == true)
    {
        m_cts_high_disconnect = false;

