espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/serialization/common/transport/ser_phy/ser_phy_nrf51_uart_stm_conn.c
        if (m_rx_state == UART_IDLE && m_tx_state == UART_IDLE)
        {
            if (m_tx_stream_index == m_tx_stream_length)
            {
                uart_peripheral_disable();
            }
        }
    }
}


static __INLINE void on_cts_low(void)
{
    m_cts_high_disconnect = false;
    (void) app_gpiote_user_disable(m_gpiote_uid);

    if (m_tx_state == UART_STALL)
    {
        m_tx_pending = true;
    }
    else if (m_tx_state == UART_TX_LAST_BYTE_WAIT)
    {
        m_tx_state = UART_TX_COMPLETE;
        uart_tx_send();
    }
    else if (m_rx_state == UART_IDLE && m_tx_state == UART_IDLE)
    {
        NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
        nrf_gpio_cfg_output(SER_PHY_UART_RTS);
        uart_peripheral_enable();
    }
}


static void uart_rxdrdy_handle(void)
{
    if (m_rx_state == UART_IDLE)
    {
        m_rx_state = UART_RX;
    }

    //Set proper size and buff at the beginning of receiving header
    if ((m_rx_stream_header == true) && !m_rx_stream_index)
    {
        m_rx_stream_length = SER_PHY_HEADER_SIZE;
        mp_rx_stream       = m_rx_length_buf;
    }

    if (mp_rx_stream != NULL)
    {
        bool tx_dual_end = false;

        NRF_UART0->EVENTS_RXDRDY = 0;

        //Second last byte received.
        //Disconnect CTS before pulling the byte and receiving the final byte.
        if ((m_rx_stream_header == false) && ((m_rx_stream_index) == (m_rx_stream_length - 2)))
        {
            nrf_gpio_cfg_output(SER_PHY_UART_RTS);

            //Last byte is waiting for tansmission. Thus dual end TX case.
            //
            if (m_tx_state == UART_TX_LAST_BYTE_WAIT)
            {
                m_tx_state = UART_STALL;
                (void) app_gpiote_user_disable(m_gpiote_uid);

                //Checking pending state.
                //- If pending is true then CTS have become low after we stalled the UART and final byte should be transmitted here.
                //- If pending is false we should check if final byte was tranmitted and if not, the do the transmission her.
                if ((m_tx_pending == true) || (m_tx_stream_index == (m_tx_stream_length - 1)))
                {
                    tx_dual_end      = true;
                    NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
                    uart_tx_send();
                }
            }

            if (!tx_dual_end)
            {
                NRF_GPIO->OUTCLR = 1 << SER_PHY_UART_RTS;
            }
            m_tx_state = UART_STALL;

            NRF_UART0->PSELCTS = UART_PIN_DISCONNECTED;
            NRF_UART0->PSELRTS = UART_PIN_DISCONNECTED;
            NRF_UART0->CONFIG &= ~(UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
        }

        if (m_rx_stream_index < (m_rx_stream_length - 1))
        {
            if (mp_rx_stream != m_rx_drop_buf)
            {
                mp_rx_stream[m_rx_stream_index++] = NRF_UART0->RXD;
            }
            else
            {
                mp_rx_stream[0] = NRF_UART0->RXD;
                m_rx_stream_index++;
            }

            if (m_tx_stream_index == (m_tx_stream_length - 1))
            {
                //Toggle CTS line to indicate ack.
                //If CTS is connected to UART this code will have no effect.
                //But on edge case on bi-directional last byte transfer this avoids lock-up.
                NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
                nrf_delay_us(4);
                NRF_GPIO->OUTCLR = 1 << SER_PHY_UART_RTS;
            }
        }
        else
        {
            if (m_rx_stream_header == false)
            {
                NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;

                if (mp_rx_stream != m_rx_drop_buf)
                {
                    mp_rx_stream[m_rx_stream_index++] = NRF_UART0->RXD;
                }
                else
                {
                    mp_rx_stream[0] = NRF_UART0->RXD;
                    m_rx_stream_index++;
                }
                m_rx_state = UART_IDLE;

                //Last byte of payload received - notify that next transmission will be header
                m_rx_stream_header = true;

                //Prepare event
                if (mp_rx_stream != m_rx_drop_buf)
                {
                    m_ser_phy_event_rx.evt_type = SER_PHY_EVT_RX_PKT_RECEIVED;
                    m_ser_phy_event_rx.evt_params.rx_pkt_received.num_of_bytes = m_rx_stream_index;
                    m_ser_phy_event_rx.evt_params.rx_pkt_received.p_buffer     = mp_rx_stream;
                }
                else
                {
                    m_ser_phy_event_rx.evt_type = SER_PHY_EVT_RX_PKT_DROPPED;
                }

                m_rx_stream_length = 0;
                m_rx_stream_index  = 0;
            }
            else
            {
                mp_rx_stream[m_rx_stream_index++] = NRF_UART0->RXD;

                //Last byte of header received - notify that next transmission will be payload
                m_rx_stream_header = false;

                mp_rx_stream = NULL;

                //Clear index before receiving payload
                m_rx_stream_index = 0;

                //Prepare event
                m_rx_stream_length = uint16_decode(m_rx_length_buf);
                m_ser_phy_event_rx.evt_type = SER_PHY_EVT_RX_BUF_REQUEST;
                m_ser_phy_event_rx.evt_params.rx_buf_request.num_of_bytes = m_rx_stream_length;
            }

            //Notify upwards
            m_ser_phy_event_handler(m_ser_phy_event_rx);

            //UART TX was stalled while receiving final byte. Restart tx.
            if (m_tx_state == UART_STALL)
            {
                if (m_tx_stream_length == m_tx_stream_index)
                {
                    m_tx_state = UART_IDLE;
                }
                else if (m_tx_stream_index == (m_tx_stream_length - 1))
                {
                    m_tx_state = UART_TX_LAST_BYTE_WAIT;
                }
                else
                {
                    m_tx_state = UART_TX_SEND;
                }

                //Critical region for avoiding timing issues in 'simultaneous RX end and TX start'
                CRITICAL_REGION_ENTER();
                if (m_tx_pending == true)
                {
                    m_tx_pending = false;
                    uart_tx_start();

                    if (m_tx_state == UART_TX_SEND)
                    {
                        uart_tx_send();
                    }
                    else if (m_tx_state == UART_TX_LAST_BYTE_WAIT)
                    {
                        uart_tx_last_byte();
                    }
                }
                CRITICAL_REGION_EXIT();

                if (m_tx_state == UART_IDLE)
                {
                    uart_peripheral_disable();
                }
            }
        }
    }
    else
    {
        m_rx_state = UART_RX_PENDING;
    }
}


static __INLINE void uart_error_handle(void)
{
    uint32_t error_source;

    //Clear UART ERROR event flag.
    NRF_UART0->EVENTS_ERROR = 0;

