espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/serialization/common/transport/ser_phy/ser_phy_nrf51_uart_stm_conn.c
    //Clear error source.
    error_source        = NRF_UART0->ERRORSRC;
    NRF_UART0->ERRORSRC = error_source;

    m_ser_phy_event_rx.evt_type                       = SER_PHY_EVT_HW_ERROR;
    m_ser_phy_event_rx.evt_params.hw_error.error_code = error_source;

    m_ser_phy_event_handler(m_ser_phy_event_rx);
}


/**@brief Function for handling the GPIOTE event.
 *
 * @param[in] event_pins_low_to_high   Mask telling which pin(s) generated an event from low->high.
 * @param[in] event_pins_high_to_low   Mask telling which pin(s) generated an event from high->low.
 */
static void gpiote_uart_event_handler(uint32_t event_pins_low_to_high,
                                      uint32_t event_pins_high_to_low)
{
    if ((event_pins_high_to_low & m_pin_cts_mask) != 0)
    {
        on_cts_low();
    }

    if ((event_pins_low_to_high & m_pin_cts_mask) != 0)
    {
        on_cts_high();
    }
}


/**@brief Function for handling the UART Interrupt.
 *
 * @details UART interrupt handler to process TX Ready when TXD is available, RX Ready when a byte
 *          is received, or in case of error when receiving a byte.
 */
void UART0_IRQHandler(void)
{
    //Handle Reception.
    if (NRF_UART0->EVENTS_RXDRDY != 0 && (NRF_UART0->INTENSET & UART_INTENSET_RXDRDY_Msk))
    {
        uart_rxdrdy_handle();
    }

    //Handle transmission.
    if (NRF_UART0->EVENTS_TXDRDY != 0 && (NRF_UART0->INTENSET & UART_INTENSET_TXDRDY_Msk))
    {
        uart_txdrdy_handle();
    }

    //Handle errors.
    if (NRF_UART0->EVENTS_ERROR != 0 && (NRF_UART0->INTENSET & UART_INTENSET_ERROR_Msk))
    {
        uart_error_handle();
    }
}


uint32_t ser_phy_open(ser_phy_events_handler_t events_handler)
{
    uint32_t gpiote_pin_low_high_mask = 0;
    uint32_t gpiote_pin_high_low_mask = 0;

    if (events_handler == NULL)
    {
        return NRF_ERROR_NULL;
    }

    //Check if function was not called before
    if (m_ser_phy_event_handler != NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    //Configure GPIOTE with one user for the UART flow control feature.
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);

    //GPIO Setup
    nrf_gpio_cfg_input(SER_PHY_UART_RTS, NRF_GPIO_PIN_NOPULL);

    NRF_GPIO->OUTSET = 1 << SER_PHY_UART_TX;
    nrf_gpio_cfg_output(SER_PHY_UART_TX);

    //Setup the gpiote to handle pin events on cts-pin.
    //For the UART we want to detect both low->high and high->low transitions in order to
    //know when to activate/de-activate the TX/RX in the UART.
    //Configure pin.
    m_pin_cts_mask = (1 << SER_PHY_UART_CTS);
    nrf_gpio_cfg_sense_input(SER_PHY_UART_CTS,
                             NRF_GPIO_PIN_PULLUP,
                             NRF_GPIO_PIN_SENSE_LOW);

    nrf_gpio_cfg_sense_input(SER_PHY_UART_RX,
                             NRF_GPIO_PIN_PULLUP,
                             NRF_GPIO_PIN_NOSENSE);

    gpiote_pin_low_high_mask = (1 << SER_PHY_UART_CTS);
    gpiote_pin_high_low_mask = (1 << SER_PHY_UART_CTS);

    (void)app_gpiote_user_register(&m_gpiote_uid,
                                   gpiote_pin_low_high_mask,
                                   gpiote_pin_high_low_mask,
                                   gpiote_uart_event_handler);

    (void)app_gpiote_user_enable(m_gpiote_uid);

    m_rx_state = UART_IDLE;
    m_tx_state = UART_IDLE;

    //Set header flag
    m_rx_stream_header = true;

    //UART setup
    NRF_UART0->PSELRXD  = SER_PHY_UART_RX;
    NRF_UART0->PSELTXD  = SER_PHY_UART_TX;
    NRF_UART0->PSELCTS  = UART_PIN_DISCONNECTED;
    NRF_UART0->PSELRTS  = UART_PIN_DISCONNECTED;
    NRF_UART0->BAUDRATE = SER_PHY_UART_BAUDRATE;
    NRF_UART0->CONFIG   = (UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
    NRF_UART0->ENABLE   = (UART_ENABLE_ENABLE_Disabled << UART_ENABLE_ENABLE_Pos);

    //Enable UART interrupt
    NRF_UART0->INTENCLR = 0xFFFFFFFF;
    NRF_UART0->INTENSET = (UART_INTENSET_TXDRDY_Set << UART_INTENSET_TXDRDY_Pos) |
                          (UART_INTENSET_RXDRDY_Set << UART_INTENSET_RXDRDY_Pos) |
                          (UART_INTENSET_ERROR_Set << UART_INTENSET_ERROR_Pos);

    NVIC_ClearPendingIRQ(UART0_IRQn);
    NVIC_SetPriority(UART0_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(UART0_IRQn);

    m_ser_phy_event_handler = events_handler;

    return NRF_SUCCESS;
}


void ser_phy_close(void)
{
    //Disable UART interrupt.
    NRF_UART0->INTENCLR = 0xFFFFFFFF;

    //Unregister callback.
    m_ser_phy_event_handler = NULL;

    //Will not check err_code here as we will still continue with closure of UART despite errors.
    //Note that any error will still be reported back in the system.
    (void)app_gpiote_user_disable(m_gpiote_uid);

    uart_peripheral_disable();

    //Clear internal UART states
    m_rx_state = UART_IDLE;
    m_tx_state = UART_IDLE;

    mp_tx_stream       = NULL;
    m_tx_stream_length = 0;
    m_tx_stream_index  = 0;

    mp_rx_stream       = NULL;
    m_rx_stream_length = 0;
    m_rx_stream_index  = 0;
}


uint32_t ser_phy_tx_pkt_send(const uint8_t * p_buffer, uint16_t num_of_bytes)
{
    if (p_buffer == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (num_of_bytes == 0)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (mp_tx_stream != NULL)
    {
        return NRF_ERROR_BUSY;
    }

    m_tx_pending = true;

    (void) uint16_encode(num_of_bytes, m_tx_length_buf);
    mp_tx_stream       = (uint8_t *)p_buffer;
    m_tx_stream_length = num_of_bytes + SER_PHY_HEADER_SIZE;

    //Critical region for avoiding timing issues in 'simultaneous RX end and TX start'
    CRITICAL_REGION_ENTER();
    if ((!m_rx_stream_length) || (m_rx_stream_index < (m_rx_stream_length - 2)))
    {
        if (m_tx_state != UART_STALL)
        {
            if (m_tx_pending == true)
            {
                m_tx_pending = false;
                uart_tx_start();
                //As no tx can be ongoing, then it is safe to call tx_send here.
                uart_tx_send();
            }
        }
    }
    CRITICAL_REGION_EXIT();

    return NRF_SUCCESS;
}


uint32_t ser_phy_rx_buf_set(uint8_t * p_buffer)
{
    if (m_ser_phy_event_rx.evt_type != SER_PHY_EVT_RX_BUF_REQUEST)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (p_buffer != NULL)
    {
        mp_rx_stream = p_buffer;
    }
    else
    {
        mp_rx_stream = m_rx_drop_buf;
    }

    return NRF_SUCCESS;
}


void ser_phy_interrupts_enable(void)
{
    NVIC_EnableIRQ(UART0_IRQn);
}


void ser_phy_interrupts_disable(void)
{
    NVIC_DisableIRQ(UART0_IRQn);
}
